docs/Abrasf_v2.02/Exemplos de XML/RecepcionarLoteRps/RecepcionarLoteRps.xml

<EnviarLoteRpsEnvio xmlns = "http://www.betha.com.br/e-nota-contribuinte-ws">
	<LoteRps  Id="numero_lote" versao="2.02">
		<NumeroLote></NumeroLote>
		<CpfCnpj>
			<Cnpj></Cnpj>
		</CpfCnpj>
		<InscricaoMunicipal></InscricaoMunicipal>
		<QuantidadeRps></QuantidadeRps>
		<ListaRps>
			<Rps>
				<InfDeclaracaoPrestacaoServico  Id="numero_rps">
					<Rps>
						<IdentificacaoRps>
							<Numero></Numero>
							<Serie></Serie>
							<Tipo></Tipo>
						</IdentificacaoRps>
						<DataEmissao></DataEmissao>
						<Status></Status>
						<RpsSubstituido>
							<Numero></Numero>
							<Serie></Serie>
							<Tipo></Tipo>
						</RpsSubstituido>
					</Rps>
					<Competencia></Competencia>
					<Servico>
						<Valores>
							<ValorServicos></ValorServicos>
							<ValorDeducoes></ValorDeducoes>
							<ValorPis></ValorPis>
							<ValorCofins></ValorCofins>
							<ValorInss></ValorInss>
							<ValorIr></ValorIr>
							<ValorCsll></ValorCsll>
							<OutrasRetencoes></OutrasRetencoes>
							<ValorIss></ValorIss>
							<Aliquota></Aliquota>
							<DescontoIncondicionado></DescontoIncondicionado>
							<DescontoCondicionado></DescontoCondicionado>	
						</Valores>
						<IssRetido></IssRetido>
						<ResponsavelRetencao></ResponsavelRetencao>
						<ItemListaServico></ItemListaServico>
						<CodigoCnae></CodigoCnae>
						<CodigoTributacaoMunicipio></CodigoTributacaoMunicipio>
						<Discriminacao></Discriminacao>
						<CodigoMunicipio></CodigoMunicipio>
						<CodigoPais></CodigoPais>
						<ExigibilidadeISS></ExigibilidadeISS>
						<MunicipioIncidencia></MunicipioIncidencia>
						<NumeroProcesso></NumeroProcesso>
					</Servico>
					<Prestador>
						<CpfCnpj>
							<Cnpj></Cnpj>
						</CpfCnpj>
						<InscricaoMunicipal></InscricaoMunicipal>
					</Prestador>
					<Tomador>
						<IdentificacaoTomador>
							<CpfCnpj>
								<Cnpj></Cnpj>
							</CpfCnpj>
							<InscricaoMunicipal></InscricaoMunicipal>				
						</IdentificacaoTomador>
						<RazaoSocial></RazaoSocial>
						<Endereco>
							<Endereco></Endereco>
							<Numero></Numero>
							<Complemento></Complemento>
							<Bairro></Bairro>
							<CodigoMunicipio></CodigoMunicipio>
							<Uf></Uf>
							<CodigoPais></CodigoPais>
							<Cep></Cep>
						</Endereco>
						<Contato>
							<Telefone></Telefone>
							<Email></Email>
						</Contato>
					</Tomador>
					<Intermediario>
						<IdentificacaoIntermediario>
							<CpfCnpj>
								<Cnpj></Cnpj>
							</CpfCnpj>
							<InscricaoMunicipal></InscricaoMunicipal>				
						</IdentificacaoIntermediario>
						<RazaoSocial></RazaoSocial>
					</Intermediario>
					<ConstrucaoCivil>
						<CodigoObra></CodigoObra>
						<Art></Art>
					</ConstrucaoCivil>
					<RegimeEspecialTributacao></RegimeEspecialTributacao>
					<OptanteSimplesNacional></OptanteSimplesNacional>
					<IncentivoFiscal></IncentivoFiscal>
				</InfDeclaracaoPrestacaoServico>
			</Rps>
		</ListaRps>
	</LoteRps>
</EnviarLoteRpsEnvio>

-----------------------------------------

<!--Com o cabeçalho Soap-->

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:e="http://www.betha.com.br/e-nota-contribuinte-ws">
   <soapenv:Header/>
   <soapenv:Body>
      <e:RecepcionarLoteRps>
        <nfseCabecMsg>
					<![CDATA[
						 <cabecalho xmlns="http://www.betha.com.br/e-nota-contribuinte-ws" versao="2.02"><versaoDados>2.02</versaoDados></cabecalho>
					]]>
				</nfseCabecMsg>
        <nfseDadosMsg>
					<![CDATA[
						<EnviarLoteRpsEnvio xmlns = "http://www.betha.com.br/e-nota-contribuinte-ws">
							<LoteRps  Id="lote" versao="2.02">
								<NumeroLote></NumeroLote>
								<CpfCnpj>
									<Cnpj></Cnpj>
								</CpfCnpj>
								<InscricaoMunicipal></InscricaoMunicipal>
								<QuantidadeRps></QuantidadeRps>
								<ListaRps>
									<Rps>
										<InfDeclaracaoPrestacaoServico  Id="lote">
											<Rps>
												<IdentificacaoRps>
													<Numero></Numero>
													<Serie></Serie>
													<Tipo></Tipo>
												</IdentificacaoRps>
												<DataEmissao></DataEmissao>
												<Status></Status>
												<RpsSubstituido>
													<Numero></Numero>
													<Serie></Serie>
													<Tipo></Tipo>
												</RpsSubstituido>
											</Rps>
											<Competencia></Competencia>
											<Servico>
												<Valores>
													<ValorServicos></ValorServicos>
													<ValorDeducoes></ValorDeducoes>
													<ValorPis></ValorPis>
													<ValorCofins></ValorCofins>
													<ValorInss></ValorInss>
													<ValorIr></ValorIr>
													<ValorCsll></ValorCsll>
													<OutrasRetencoes></OutrasRetencoes>
													<ValorIss></ValorIss>
													<Aliquota></Aliquota>
													<DescontoIncondicionado></DescontoIncondicionado>
													<DescontoCondicionado></DescontoCondicionado>	
												</Valores>
												<IssRetido></IssRetido>
												<ResponsavelRetencao></ResponsavelRetencao>
												<ItemListaServico></ItemListaServico>
												<CodigoCnae></CodigoCnae>
												<CodigoTributacaoMunicipio></CodigoTributacaoMunicipio>
												<Discriminacao></Discriminacao>
												<CodigoMunicipio></CodigoMunicipio>
												<CodigoPais></CodigoPais>
												<ExigibilidadeISS></ExigibilidadeISS>
												<MunicipioIncidencia></MunicipioIncidencia>
												<NumeroProcesso></NumeroProcesso>
											</Servico>
											<Prestador>
												<CpfCnpj>
													<Cnpj></Cnpj>
												</CpfCnpj>
												<InscricaoMunicipal></InscricaoMunicipal>
											</Prestador>
											<Tomador>
												<IdentificacaoTomador>
													<CpfCnpj>
														<Cnpj></Cnpj>
													</CpfCnpj>
													<InscricaoMunicipal></InscricaoMunicipal>				
												</IdentificacaoTomador>
												<RazaoSocial></RazaoSocial>
												<Endereco>
													<Endereco></Endereco>
													<Numero></Numero>
													<Complemento></Complemento>
													<Bairro></Bairro>
													<CodigoMunicipio></CodigoMunicipio>
													<Uf></Uf>
													<CodigoPais></CodigoPais>
													<Cep></Cep>
												</Endereco>
												<Contato>
													<Telefone></Telefone>
													<Email></Email>
												</Contato>
											</Tomador>
											<Intermediario>
												<IdentificacaoIntermediario>
													<CpfCnpj>
														<Cnpj></Cnpj>
													</CpfCnpj>
													<InscricaoMunicipal></InscricaoMunicipal>				
												</IdentificacaoIntermediario>
												<RazaoSocial></RazaoSocial>
											</Intermediario>
											<ConstrucaoCivil>
												<CodigoObra></CodigoObra>
												<Art></Art>
											</ConstrucaoCivil>
											<RegimeEspecialTributacao></RegimeEspecialTributacao>
											<OptanteSimplesNacional></OptanteSimplesNacional>
											<IncentivoFiscal></IncentivoFiscal>
										</InfDeclaracaoPrestacaoServico>
									</Rps>
								</ListaRps>
							</LoteRps>
						</EnviarLoteRpsEnvio>
					]]>
				</nfseDadosMsg>
      </e:RecepcionarLoteRps>
   </soapenv:Body>
</soapenv:Envelope>